Revit 2027 API
SteelElementsFailures Properties
The BuiltInFailures.SteelElementsFailures type exposes the following members.
Properties
Name | Description
SteelElementInvisibleInCurrentLevelOfDetailWarn |  The created elements are only visible in Detail Level: Fine.
SteelElementModifiersWillBeIgnoredWarn |  The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.
Top
See Also
Reference
BuiltInFailures.SteelElementsFailures Class
Autodesk.Revit.DB Namespace